{
    "header": 
        [
            {"item":
                {
                    "heading": "About", 
                    "link": "",
                    "sectionContent": [
                        "I was born in the United Kingdom and lived right outside of London until the age of six, after which my family moved to Tampa, Florida, where I've lived until I left for Atlanta. I've always loved to make things and spent countless hours growing up working on an incredible variety of projects. From one of the first generation Raspberry Pis, I learned about how computers interact with the wider internet, spinning up web servers and tools to use day to day around the house. Later, I learned to fly RC aircraft after hours of crashing a beat up flying wing into the ground.",
                        "As a third-year student at Georgia Tech, I've progressed through much of the Aerospace Engineering curriculum, having completed Thermo and Fluids Fundamentals, Aerodynamics, and Mechanics of Deformable Bodies to name a few. I'm involved in the Georgia Tech Design, Build, Fly Club and serve as a student advisor in a Freshman Leadership Organization on campus called Emerging Leaders.",
                        "Outside of school, I love getting outside. I spend much of my free time running on the Beltline or in Piedmont park. I love being in Atlanta, close to music festivals, sports, and so much more. My hope is that this little website gives you something of an idea of who I am and what I get excited about. Nothing is ever comprehensive, so if you would like to have a conversation, lets connect!"
                    ],
                    "photoPath": "headshot.jpg",
                    "photoAlt": "Individual Photo"
                }
            },
            {"item":
                {
                    "heading": "Experience", 
                    "link": "",
                    "sectionContent": [
                        {
                            "job":
                            {   
                                "company": "WestRock Corporation",
                                "location": "Atlanta, GA",
                                "jobTitle": "Technology Intern",
                                "start": "May 2021",
                                "end": "May 2022",
                                "description": "Working alongside the WestRock Corporate Tax team to develop internal tools to smooth the tax process. Tools are built with the Microsoft Power Platform, primarily utilizing PowerApps as a front-end interface, PowerAutomate for data processing, and Microsoft Dataverse as a back-end.",
                                "bullets": 
                                    [
                                        "Developed a system to streamline department-wide task management and create a centralized tax workflow at a savings of $250,000 from an external vendor",
                                        "Building and implementing custom connectors to access and modify data from external tools such as Thomson Reuters ONESOURCE and Alteryx",
                                        "Continuing to develop and implement systems to process department-scale data to aid and inform executive decision making"
                                    ],
                                "imagePath": "wrkLogo.png"
                            }
                        },
                        {
                            "job":
                            {   
                                "company": "Urban Kai",
                                "location": "Tampa, FL",
                                "jobTitle": "Retail Sales Manager",
                                "start": "November 2020",
                                "end": "January 2021",
                                "description": "Worked at a local outfitter selling outdoor clothing and equipment. Located on the Hillsborough River near Armature Works, this location had access to a slip from which kayak and paddleboard rentals were launched. I was responsible for managing both sales and rentals throughout the course of the day, helping customers find what they were looking for, while making sure that our rental customers were safe out on the water.",
                                "bullets": 
                                    [
                                        "Developed an internal inventory management system to validate POS data and centralize the inventory process between two retail locations, leading to a five-fold increase in process speed",
                                        "Created and implemented a novel rental onboarding process, minimizing customer-employee touchpoints and increasing overall process speed by a factor of three"
                                    ],
                                "imagePath": "urbanKaiLogo.png"
                            }
                        },
                        {
                            "job":
                            {   
                                "company": "Tampa Metropolitan Area YMCA",
                                "location": "Tampa, FL",
                                "jobTitle": "Summer Camp Counselor",
                                "start": "May 2019",
                                "end": "August 2020",
                                "description": "Spent two summers working as a camp counselor while in high school. Day-to-day responsibilities varied; however, I was typically in charge of check-in and check-out in the hours before programming started and would remain with a group through programming.",
                                "bullets": 
                                    [
                                        "In charge of basketball camp in 2020, along with one of my co-workers, during which we were responsible for planning drills, officiating scrimmages, in addition to other general camp activities.", 
                                        "Was nicknamed \"The Governor\" by a parent in appreciation of my enthusiasm at check-in early in the morning"
                                    ],
                                "imagePath": "yLogo.png"
                            }
                        },
                        {
                            "job":
                            {   
                                "company": "Tampa Metropolitan Area YMCA",
                                "location": "Tampa, FL",
                                "jobTitle": "Youth Sports Official",
                                "start": "March 2018",
                                "end": "August 2020",
                                "description": "Worked as a sports official from the age of 16 until leaving for college. Was responsible for officiating recreational soccer games for leagues ranging from ages 3-5 all the way to ages 12-14. Worked to ensure fair and safe play, while simultaneously responding to the demands of coaches and parents. Managed and maintained the fields on-site.",
                                "bullets": [],
                                "imagePath": "yLogo.png"
                            }
                        }
                    ]
                }
            },
            {"item":
                {
                    "heading": "Projects",
                    "link": "",
                    "sectionContent": [
                        {
                            "project": {
                                "name": "1995 Ford Bronco",
                                "shortDescription": "Short description",
                                "longDescription": "Through most of high school I had the pleasure of sharing a 1995 Ford Bronco with my younger brother. Originally belonging to a neighbor, it had sat untouched in his driveway for years, while the elements did their work on the mechanics of the vehicle. Over the few years I've been driving the Bronco, I can't say that I've gone more than a month without something needing work, all the way from losing some of the interior trim to failures that forced me to push the car from the middle of a busy intersection. Like most vehicles, it's often less of a project than it is a complete experience, one that is incredibly frustrating as well as rewarding.",
                                "images": ["bronco.jpeg", "headlights.jpeg", "speedo.png"],
                                "tasks" : ["Diagnosed and corrected shift timing issues associated with a faulty speedometer", "Correction for hardware failures including belts, window motors, and dashboard structure", ""],
                                "tags": ["Automotive Repair", "Sourcing Components", "System Trouleshooting" ,"Subsystem Interaction"],
                                "link": ""
                            }
                        },
                        {
                            "project": {
                                "name": "Outdoor Deck in East Tampa",
                                "shortDescription": "Short description",
                                "longDescription": "This project was my Eagle project for Boy Scouts, and I wanted to make sure that I wasn’t simply turning to someone else to do the hard work for me, as I had seen with other projects in the past. However, the reality of the situation was that I didn’t know how to build a deck. I was so focused on making sure that everything would come out perfectly, that I had no idea where to start. It was only in reaching out to a trusted advisor for assistance that I was able to get some sense of direction for the project. He helped me to execute upon my ideas and brought years of experience and advice to the table. I learned more about the construction process than I ever thought possible, and with his guidance, I was able to move forward. It was an experience that helped me to understand the importance of recognizing when you’re in over your head. By asking for help, I wasn’t handing over the project, I was simply admitting that I didn’t have the resources and experience necessary to create what I had envisioned. By turning to someone else, not only was I able to complete the project, the end result was far beyond anything I had previously envisioned.",
                                "images": ["completedDeck.jpg", "emptyBackyard.jpg","framing.jpeg","framed.jpeg", "startingSurface.jpeg","finishingSurface.jpeg"],
                                "tags": ["Woodworking", "Construction", "Project Management", "Fundraising", "Practical Design", "SWOT Analysis"],
                                "link": ""
                            }
                        },
                        {
                            "project": {
                                "name": "Georgia Tech Design, Build, Fly",
                                "shortDescription": "Short description",
                                "longDescription": "As a member of the Georgia Tech Design, Build, Fly Advanced Class team, I have played a significant number of roles. Every aircraft built is an all-hands effort, with members pitching in wherever needed in order to get the aircraft completed. I have cut ribs, covered wingtips to centerbodies, and glued my fingers together more times than I can count. Over the last year, three main aircraft were built, along with 4 smaller aircraft, called PADAs, deployed midair from the main aircraft. At this year's competition, I was responsible for piloting the PADA to the ground following a successful release from the main aircraft. Our team placed 2nd in the world, placing us in an advantageous position to iterate on as we enter this new competition cycle. The primary focus for the upcoming year will be the development of an aerial sensing system for target acquisition, integration of this system into the existing data acquisition system, and the improvement upon existing PADA vehicles.",
                                "images": ["dbfSpring2022.jpeg", "sb3.jpeg","padas.jpeg", "coveringPada.jpeg"],
                                "tags": ["Laser Cutting", "AutoCAD", "Soldering", "ArduPilot", "Aircraft Covering"],
                                "link": ""
                            }
                        },
                        {
                            "project": {
                                "name": "Final Project - Engineering Design",
                                "shortDescription": "Short description",
                                "longDescription": "The goal of this project was to develop and present a complex assembly with ~120 parts compiled by a team of six as well as to demonstrate a thorough understanding of 3D modeling techniques and CAD best practices. Choosing to model a standing desk with a unique scissor-lift mechanism, the desk was split into six respective subassemblies of around 20 components each. Subassemblies included the desk frame and the included raising and lowering mechanism, a modular shelving and lighting system, a modular drawer and internal storage system, and a few others. Subassemblies and the primary assembly were joined with common toolbox components or built-in attachment mechanisms, as required by the design.",
                                "images": ["neutralZoomedOutLit.jpg", "closeRender.jpg", "neutralRendered.jpg"],
                                "tags": ["SolidWorks", "Project Management", "Collaboration", "Design for Manufacturing", "Dimensioning and Tolerancing", "3D Rendering"],
                                "link": ""
                            }
                        },
                        {
                            "project": {
                                "name": "Pneumatic Air Cannon",
                                "shortDescription": "Short description",
                                "longDescription": "Constructed from schedule 40 PVC and designed around a schrader valve, the cannon is conservatively designed to operate under ~150 PSI. The chamber is pressurized with either a manual bike pump or a consumer pump for sporting equipment. Pressure is released through a valve designed for automated and scheduled release of water to sprinkler lines. By modifying this valve to accommodate an air compressor blow gun attachment, the valve actuates in significantly less time, leading to a far greater impulse to the projectile. The projectile utilized in the conduct of this experiment was 3D printed at a constant height, allowing for velocity measurements with an infrared photogate placed at the end of the barrel. The photogate being used as a tool for evaluation of the cannon's performance as a function of exit velocity and chamber pressure.",
                                "images": ["airCannon.jpeg", "cannonSetup.jpeg","cannonProjectile.jpeg"],
                                "tags": ["Pressure Vessels", "Data Collection and Processing", "3D Printing", "Dimensioning and Tolerancing", "Experimental Design"],
                                "link": "if applicable"
                            }
                        }
                    ]
                }
            },
            {"item":
                {
                    "heading": "Contact", 
                    "link": "",
                    "name": "Ryan Joseph Warner",
                    "email": "ryan.warner@gatech.edu",
                    "phone": "813-613-4828",
                    "address": "120 North Ave, Atlanta, GA 30332"
                }
            },
            {"item":
                {
                    "heading": "Resume", 
                    "filePath": "Resume Fall 2022.pdf"
                }
            }
        ],
    "intro":
        {
            "primaryIntro": "Hi, my name is Ryan Warner!",
            "secondaryIntro": "I'm an Aerospace Engineering student at the Georgia Institute of Technology. I'm interested in using technology and engineering to solve real-world problems."
        },
    "footer":
        {
            "links": [
                {
                    "item": {
                        "linkTo": "Github",
                        "url": "https://github.com/ryan-warner/"
                    }
                },
                {
                    "item": {
                        "linkTo": "Twitter",
                        "url": "https://twitter.com/ryanw_arner"
                    }
                },
                {
                    "item": {
                        "linkTo": "Instagram",
                        "url": "https://www.instagram.com/ryanw.arner/"
                    }
                },
                {
                    "item": {
                        "linkTo": "LinkedIn",
                        "url": "https://www.linkedin.com/in/warner-ryan/"
                    }
                }
            ]
            
        }
}
